released/M031BSP_I2C_NSP2340A/SampleCode/Template/nsp_driver.c
#include "nsp_driver.h"
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#define I2C_BUF_SIZE   	520	
UINT8   u8WriteBuffer[I2C_BUF_SIZE];
UINT8   u8ReadBuffer[I2C_BUF_SIZE];
UINT16  u16TimeoutCounter = 0;
UINT16  u16CMD_TX_BYTE	= 0;
UINT16  u16CMD_RX_BYTE	= 0;
UINT8   u8RX_ERROR_COUNT=0;			

// #define NSP_TIMER				(TIMER0)
#define NSP_I2C_ADDR			(0x5A)		// customize in NSP playlist editor tool , when interface set as I2C

extern void I2C0_Init(void);
extern char i2c_reg_write(unsigned char i2c_addr, unsigned int reg_addr, unsigned char *reg_data, unsigned int length);
extern char i2c_reg_read(unsigned char i2c_addr, unsigned int reg_addr, unsigned char *reg_data, unsigned int length);
//===========================================================
//Systerm intial, please modify according to your MCU platform
void HOST_BUS_Init(void)
{
	// ?O???_??I2C,?O???l?? and Slave address.
	I2C0_Init();
}

//Systerm intial, please modify according to your MCU platform
UINT16 N_I2C_READ(UINT16 READ_SIZE)
{
	// ?O???x?I2C?Y??, u8ReadBuffer ?????FIFO??????????,u16CMD_RX_BYTE ?????????????
	i2c_reg_read(NSP_I2C_ADDR,0x00, (unsigned char *) &u8ReadBuffer[0] , u16CMD_RX_BYTE);
	return READ_SIZE;
}

//Systerm intial, please modify according to your MCU platform
UINT16 N_I2C_WRITE(UINT16 WRITE_SIZE)
{
	// ?ам????I2C????,u8WriteBuffer ?????????????????FIFO????,u16CMD_TX_BYTE ??????????
	i2c_reg_write(NSP_I2C_ADDR,0x00, (unsigned char *) &u8WriteBuffer[0], u16CMD_TX_BYTE);
	return WRITE_SIZE;
}
//----------------------------------
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_I2C_WRITE_DURATION(void)
{
//????I2C???????;  Delay time
	// TIMER_Delay( NSP_TIMER, 1000);
	CLK_SysTickDelay(1000);
}
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_I2C_READ_DURATION(void)
{
//????I2C????????;  Delay time
	// TIMER_Delay( NSP_TIMER, 1000);	
	CLK_SysTickDelay(1000);
}
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_CMD_INTERVAL(void)
{
//??????????2ms;  Delay time 2ms
	// TIMER_Delay( NSP_TIMER, 2000);
	CLK_SysTickDelay(2000);
}
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_Delay500uS(void)
{
//??????????500us;  Delay time 500us
	// TIMER_Delay( NSP_TIMER, 500);
	CLK_SysTickDelay(500);
}
//===========================================================
void HOST_Init(UINT8* SP_VOL)
{
	*SP_VOL = 0x80;	
}
//===========================================================
void HOST_ADD_TIMEOUT_COUNTER(void)
{
	u16TimeoutCounter++;
}
void HOST_CLR_TIMEOUT_COUNTER(void)
{
	u16TimeoutCounter = 0;
}
//------------------------------------------------
UINT8 CHECK_I2C_READ_RIGHT()
{
	UINT16 i = 0;
	UINT8 CMD_CHECKSUM = 0;
	
	if (u16CMD_RX_BYTE == 1)
	{
		if (u8ReadBuffer[0] == RIGHT_RTN)
		{
			u8RX_ERROR_COUNT = 0;
			return 1;
		}
		if (u8ReadBuffer[0] == ERROR_RTN)
		{
			u8RX_ERROR_COUNT ++;
			return 0;
		}	
		if (u8ReadBuffer[0] == UNSUPPORTED_RTN)
		{
			u8RX_ERROR_COUNT = 0;
			return 0xFF;
		}
	}
	else
	{
		for(i = 0; i < (u16CMD_RX_BYTE-1); i++)
		{
			CMD_CHECKSUM += u8ReadBuffer[i];
		}
		if ((CMD_CHECKSUM ^ u8ReadBuffer[u16CMD_RX_BYTE-1]) == 0xFF)
		{
			u8RX_ERROR_COUNT = 0;
			return 1;
		}
		else
		{
			u8RX_ERROR_COUNT ++;
			return 0;
		}
	}	
	return 0;
}
//----------------------------------
UINT8 Host_CommonProcess(void)
{
	// Write(Send) Process.
	if( N_I2C_WRITE(u16CMD_TX_BYTE) == 0 )
		return 0;
	HOST_I2C_WRITE_DURATION();
	// Read(Receive) Process.
	if( N_I2C_READ(u16CMD_RX_BYTE) == 0 )
		return 0;
	HOST_I2C_READ_DURATION();	
	// 
	return CHECK_I2C_READ_RIGHT();
}
//------------------------------------------------
void ADD_I2C_WRITE_CHECKSUM(UINT8 u8CMDBytes,UINT16 u16BufferBytes,UINT8 *DATA_BUFFER)
{	
	UINT16 i = 0;
	UINT8 CMD_CHECKSUM = 0;
	for(i = 0; i < u8CMDBytes; i++)
	{
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[i]) & 0xFF);
	}
	for(i = 0; i < u16BufferBytes; i++)
	{
		u8WriteBuffer[u8CMDBytes+i] = *DATA_BUFFER;
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[u8CMDBytes+i]) & 0xFF);
		DATA_BUFFER++;
	}
	u8WriteBuffer[u16CMD_TX_BYTE-1] = (CMD_CHECKSUM ^ 0xFF );
}
//------------------------------------------------
void ADD_I2C_WRITE_CHECKSUM_2B(UINT8 u8CMDBytes,UINT16 u16BufferBytes,UINT16 *DATA_BUFFER)
{	
	UINT16 i = 0;
	UINT8 CMD_CHECKSUM = 0;
	for(i = 0; i < u8CMDBytes; i++)
	{
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[i]) & 0xFF);
	}
	for(i = 0; i < u16BufferBytes; i++)
	{
		u8WriteBuffer[u8CMDBytes+2*i] = (*DATA_BUFFER  & 0xFF00)>>8;
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[u8CMDBytes+2*i]) & 0xFF);
		u8WriteBuffer[u8CMDBytes+2*i+1] = (*DATA_BUFFER  & 0xFF);
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[u8CMDBytes+2*i+1]) & 0xFF);
		DATA_BUFFER++;
	}
	u8WriteBuffer[u16CMD_TX_BYTE-1] = (CMD_CHECKSUM ^ 0xFF );
}
//----------------------------------
void N_SLAVE_RESET(void)
{
	if(u8RX_ERROR_COUNT >=5) 
	{
		u8RX_ERROR_COUNT = 0;
		N_RESET();	
	}
}
//===========================================================
// function command
UINT8 N_READ_ID(UINT32* PID)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_READ_ID;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_READ_ID_TX_BYTE;
	u16CMD_RX_BYTE = CMD_READ_ID_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		 *PID = (u8ReadBuffer[0]<<24) | (u8ReadBuffer[1]<<16) | (u8ReadBuffer[2]<<8) | u8ReadBuffer[3];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_READ_STATUS(UINT8* COMMAND_STATUS)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_READ_STATUS;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_READ_STATUS_TX_BYTE;
	u16CMD_RX_BYTE = CMD_READ_STATUS_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*COMMAND_STATUS = u8ReadBuffer[0];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_DO_LVD(void)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_DO_LVD;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_DO_LVD_TX_BYTE;
	u16CMD_RX_BYTE = CMD_DO_LVD_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_LVD(UINT8* LVD_STATUS)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_LVD;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_LVD_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_LVD_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*LVD_STATUS = u8ReadBuffer[0];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_CHECKSUM_RIGHT(UINT8* CHECKSUM_BIT)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_CHECKSUM_RIGHT;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_CHECKSUM_RIGHT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_CHECKSUM_RIGHT_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*CHECKSUM_BIT = u8ReadBuffer[0];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_CHECKSUM(UINT16* CHECKSUM_BYTES)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_CHECKSUM;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_CHECKSUM_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_CHECKSUM_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*CHECKSUM_BYTES = (u8ReadBuffer[0]<<8) | u8ReadBuffer[1];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_DO_CHECKSUM(void)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_DO_CHECKSUM;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_DO_CHECKSUM_TX_BYTE;
	u16CMD_RX_BYTE = CMD_DO_CHECKSUM_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_FW_VERSION(UINT32* PFW_VERSION)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_FW_VERSION;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_FW_VERSION_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_FW_VERSION_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		 *PFW_VERSION = (u8ReadBuffer[0]<<16) | (u8ReadBuffer[1]<<8) | u8ReadBuffer[2];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_PLAY_REPEAT(UINT8 REPEAT_COUNT)
{
	UINT8 RTN = 0;
	
	u8WriteBuffer[0] = CMD_REPEAT;
	u8WriteBuffer[1] = REPEAT_COUNT;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_REPEAT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_REPEAT_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_STOP_REPEAT()
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_STOP_REPEAT;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_STOP_REPEAT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_STOP_REPEAT_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_PLAY(UINT16 PlayListIndex)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_PLAY;
	u8WriteBuffer[1] = PlayListIndex >>8;
	u8WriteBuffer[2] = PlayListIndex & 0xFF;
	u8WriteBuffer[3] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_PLAY_TX_BYTE;
	u16CMD_RX_BYTE = CMD_PLAY_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_PLAY_CHANNEL(UINT8 ChannelMsk, UINT16* PlayIndexArry)
{
	UINT8 RTN = 0, u8Count = 0, u8Checksum = 0;
	u8WriteBuffer[0] = CMD_PLAY_CHANNEL;
	u8WriteBuffer[1] = ChannelMsk;
	u8Checksum += u8WriteBuffer[0];
	u8Checksum += u8WriteBuffer[1];
	if( ChannelMsk&BIT0 )
	{
		u8WriteBuffer[2] = PlayIndexArry[0] >>8;
		u8Checksum += u8WriteBuffer[2];
		u8WriteBuffer[3] = PlayIndexArry[0] & 0xFF;	
		u8Checksum += u8WriteBuffer[3];
		u8Count = 1;
	}
	if( ChannelMsk&BIT1 )
	{
		u8WriteBuffer[2+u8Count*2] = PlayIndexArry[u8Count] >>8;
		u8Checksum += u8WriteBuffer[2+u8Count*2];
		u8WriteBuffer[2+u8Count*2+1] = PlayIndexArry[u8Count] & 0xFF;	
		u8Checksum += u8WriteBuffer[2+u8Count*2+1];
		u8Count += 1;
	}	
	u8WriteBuffer[2+u8Count*2] = u8Checksum ^ 0xff;

	u16CMD_TX_BYTE = CMD_PLAY_CHANNEL_TX_BYTE + u8Count*2;
	u16CMD_RX_BYTE = CMD_PLAY_CHANNEL_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;	
}
//----------------------------------
UINT8 N_PLAY_SLEEP(UINT16 PlayListIndex)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_PLAY_SLEEP;
	u8WriteBuffer[1] = PlayListIndex >>8;
	u8WriteBuffer[2] = PlayListIndex & 0xFF;
	u8WriteBuffer[3] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_PLAY_SLEEP_TX_BYTE;
	u16CMD_RX_BYTE = CMD_PLAY_SLEEP_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_IO_CONFIG(UINT8 IO_FLAG)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_IO_CONFIG;
	u8WriteBuffer[1] = IO_FLAG;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_IO_CONFIG_TX_BYTE;
	u16CMD_RX_BYTE = CMD_IO_CONFIG_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_IO_TYPE(UINT8* READ_IO_FLAG)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_IO_TYPE;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_IO_TYPE_TX_BYTE;
	u16CMD_RX_BYTE = CMD_IO_TYPE_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*READ_IO_FLAG = u8ReadBuffer[0];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_SET_OUT(UINT8 IO_VALUE)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_SET_OUT;
	u8WriteBuffer[1] = IO_VALUE;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_SET_OUT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_SET_OUT_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_INOUT(UINT8* READ_IO_VALUE)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_INOUT;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_INOUT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_INOUT_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*READ_IO_VALUE = u8ReadBuffer[0];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_BZPIN_EN()
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_BZPIN_EN;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_BZPIN_EN_TX_BYTE;
	u16CMD_RX_BYTE = CMD_BZPIN_EN_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_BZPIN_DIS()
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_BZPIN_DIS;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_BZPIN_DIS_TX_BYTE;
	u16CMD_RX_BYTE = CMD_BZPIN_DIS_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_SET_VOL(UINT8 SP_VOL)
{
	UINT8 RTN = 0;
	
	u8WriteBuffer[0] = CMD_SET_VOL_NSP;
	u8WriteBuffer[1] = SP_VOL;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_SET_VOL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_SET_VOL_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_VOL(UINT8* SP_VOL)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_VOL;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_VOL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_VOL_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*SP_VOL = u8ReadBuffer[0];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
//After the host sends STOP cmd,
//it will send READ_STATUS cmd every interval (HOST_CMD_INTERVAL), 
//and the loop will execute until the READ_STATUS cmd gets the correct result, 
//so as to ensure that the NSP STOP operation has been completed.
UINT8 N_STOP()
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_STOP;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_STOP_TX_BYTE;
	u16CMD_RX_BYTE = CMD_STOP_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_Delay500uS();
		HOST_Delay500uS();
	}
	return RTN;
}
//----------------------------------
UINT8 N_STOP_CHANNEL(UINT8 ChannelMsk)
{
	UINT8 RTN = 0;

