released/M031BSP_I2C_NSP2340A/SampleCode/Template/nsp_driver.c
	ADD_I2C_WRITE_CHECKSUM(CMD_ISP_WRITE_PARTIAL_TX_BYTE-1, ISPSize ,ISP_BUFFER);
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_MULTI_PLAY(UINT8 PlayListNum,PUINT8 DATA_BUFFER)
{
	UINT8 RTN = 0;
	
	u8WriteBuffer[0] = CMD_MULTI_PLAY;
	u8WriteBuffer[1] = PlayListNum;
	u16CMD_TX_BYTE = CMD_MULTI_PLAY_TX_BYTE+PlayListNum-1;
	u16CMD_RX_BYTE = CMD_MULTI_PLAY_RX_BYTE;
	
	ADD_I2C_WRITE_CHECKSUM(2, PlayListNum ,DATA_BUFFER);
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_MULTI_PLAY_2B(UINT8 PlayListNum,PUINT16 DATA_BUFFER)
{
	UINT8 RTN = 0;
	
	u8WriteBuffer[0] = CMD_MULTI_PLAY_2B;
	u8WriteBuffer[1] = PlayListNum;
	u16CMD_TX_BYTE = CMD_MULTI_PLAY_2B_TX_BYTE + PlayListNum * 2;
	u16CMD_RX_BYTE = CMD_MULTI_PLAY_2B_RX_BYTE;
	
	ADD_I2C_WRITE_CHECKSUM_2B(2, PlayListNum ,DATA_BUFFER);
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_AUTO_SLEEP_EN()
{
	UINT8 RTN = 0;
	
	u8WriteBuffer[0] = CMD_AUTO_SLEEP_EN;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_AUTO_SLEEP_EN_TX_BYTE;
	u16CMD_RX_BYTE = CMD_AUTO_SLEEP_EN_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;	
}
//----------------------------------
UINT8 N_AUTO_SLEEP_DIS()
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_AUTO_SLEEP_DIS;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_AUTO_SLEEP_DIS_TX_BYTE;
	u16CMD_RX_BYTE = CMD_AUTO_SLEEP_DIS_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
//After the host sends STOP cmd,
//it will send READ_STATUS cmd 500ms, 
//and the loop will execute until the READ_STATUS cmd gets the correct result, 
//so as to ensure that the NSP STOP operation has been completed.
UINT8 N_PAUSE()
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_PAUSE;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_PAUSE_TX_BYTE;
	u16CMD_RX_BYTE = CMD_PAUSE_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_PAUSE_CHANNEL(UINT8 ChannelMsk)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_PAUSE_CHANNEL;
	u8WriteBuffer[1] = ChannelMsk;
	u8WriteBuffer[2] = ( u8WriteBuffer[0] + u8WriteBuffer[1] ) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_PAUSE_CHANNEL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_PAUSE_CHANNEL_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1))
	{
		HOST_Delay500uS();
		HOST_Delay500uS();
	}
	return RTN;	
}
//----------------------------------
//After the host sends STOP cmd,
//it will send READ_STATUS cmd 500ms, 
//and the loop will execute until the READ_STATUS cmd gets the correct result, 
//so as to ensure that the NSP STOP operation has been completed.
UINT8 N_RESUME()
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_RESUME;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_RESUME_TX_BYTE;
	u16CMD_RX_BYTE = CMD_RESUME_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	while (N_READ_STATUS(&u8NSP_STATUS1) != 1)
	{
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_RESUME_CHANNEL(UINT8 ChannelMsk)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_RESUME_CHANNEL;
	u8WriteBuffer[1] = ChannelMsk;
	u8WriteBuffer[2] = ( u8WriteBuffer[0] + u8WriteBuffer[1] ) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_RESUME_CHANNEL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_RESUME_CHANNEL_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	while (N_READ_STATUS(&u8NSP_STATUS1) != 1)
	{
		HOST_CMD_INTERVAL();
	}
	return RTN;	
}
//----------------------------------
UINT8 N_CHECK_INDEX_RCOUNT(UINT16 PlayListIndex)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_CHECK_INDEX_RCOUNT;
	u8WriteBuffer[1] = PlayListIndex >>8;
	u8WriteBuffer[2] = PlayListIndex & 0xFF;
	u8WriteBuffer[3] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_CHECK_INDEX_RCOUNT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_CHECK_INDEX_RCOUNT_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_INDEX_RCOUNT(UINT8* RESOURCE_COUNT)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_INDEX_RCOUNT;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_INDEX_RCOUNT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_INDEX_RCOUNT_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*RESOURCE_COUNT = u8ReadBuffer[0];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_MAX_INDEX(UINT16* MAX_INDEX)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_MAX_INDEX;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_MAX_INDEX_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_MAX_INDEX_RX_BYTE;
	
//	N_I2C_WRITE(u16CMD_TX_BYTE);
//	HOST_I2C_WRITE_DURATION();
//	N_I2C_READ(u16CMD_RX_BYTE);
//	HOST_I2C_READ_DURATION();
//	RTN = CHECK_I2C_READ_RIGHT();
	RTN = Host_CommonProcess();
	if (RTN == 1)
	{
		*MAX_INDEX = (u8ReadBuffer[0]<<8) | u8ReadBuffer[1];
	}
	
	HOST_CMD_INTERVAL();
	return RTN;
}//----------------------------------
UINT8 N_TOUCH_READSTATUS(UINT8 COUNT,UINT8* STATUS)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_TOUCH_READ_STATUS;
	u8WriteBuffer[1] = COUNT;
	u8WriteBuffer[2] = (u8WriteBuffer[0]+u8WriteBuffer[1]) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_TOUCH_READ_STATUS_TX_BYTE;
	u16CMD_RX_BYTE = CMD_TOUCH_READ_STATUS_RX_BYTE+COUNT;

	RTN = Host_CommonProcess();
	
	if( RTN == 1 )
		memcpy(STATUS,u8ReadBuffer,COUNT);

	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_TOUCH_UPDATA(UINT8 CS, UINT16 CNT, PUINT8 DATA_BUFFER)
{
	UINT8 RTN = 0, u8i;
	u8WriteBuffer[0] = CMD_TOUCH_UPDATA;
	u8WriteBuffer[1] = CS;
	u8WriteBuffer[2] = CNT>>8;
	u8WriteBuffer[3] = CNT;
	memcpy( &u8WriteBuffer[4], DATA_BUFFER, CNT );	
	// Cal checksum.
	u8WriteBuffer[CMD_TOUCH_UPDATA_TX_BYTE+CNT-1] = 0;
	for( u8i=0; u8i<CMD_TOUCH_UPDATA_TX_BYTE+CNT-1; u8i++ )
		u8WriteBuffer[CMD_TOUCH_UPDATA_TX_BYTE+CNT-1] += u8WriteBuffer[u8i];
	u8WriteBuffer[CMD_TOUCH_UPDATA_TX_BYTE+CNT-1] ^= 0xff;
	
	u16CMD_TX_BYTE = CMD_TOUCH_UPDATA_TX_BYTE+CNT;
	u16CMD_RX_BYTE = CMD_TOUCH_UPDATA_RX_BYTE;
	
	RTN = Host_CommonProcess();
	
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_TOUCH_LOAD(UINT8 CS, UINT16 CNT, PUINT8 DATA_BUFFER)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_TOUCH_LOAD;
	u8WriteBuffer[1] = CS;
	u8WriteBuffer[2] = CNT>>8;
	u8WriteBuffer[3] = CNT;
	u8WriteBuffer[4] = ( u8WriteBuffer[0] + u8WriteBuffer[1] + u8WriteBuffer[2] + u8WriteBuffer[3] ) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_TOUCH_LOAD_TX_BYTE;
	u16CMD_RX_BYTE = CMD_TOUCH_LOAD_RX_BYTE+CNT;
	
	RTN = Host_CommonProcess();

	if( RTN == 1 )
		memcpy(DATA_BUFFER,u8ReadBuffer,CNT);
	
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_READ_SLAVE_ADDR(UINT8* ADDR)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_READ_SLAVE_ADDR;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_READ_SLAVE_ADDR_TX_BYTE;
	u16CMD_RX_BYTE = CMD_READ_SLAVE_ADDR_RX_BYTE;
	
	RTN = Host_CommonProcess();
	
	if (RTN == 1)
	{
		*ADDR = u8ReadBuffer[0];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
void N_WAKUP(void)
{
	UINT8 u8NSP_STATUS1 = 0;
	N_READ_STATUS(&u8NSP_STATUS1);
	HOST_CMD_INTERVAL();
}


